; domain
(define (domain monkey-bananas)	       
  (:requirements :strips)
 
  (:constants monkey chair bananas)
 
  (:predicates (location ?x)
	       (on-floor)
	       (at ?m ?x)
	       (onchair ?x)
	       (hasbananas))
  
  (:action MOVE-MONKEY
	     :parameters (?x ?y)
	     :precondition (and (location ?x) (location ?y) (on-floor) (at monkey ?y))
	     :effect (and (at monkey ?x) (not (at monkey ?y))))
  
  (:action CLIMB
	     :parameters (?x)
	     :precondition (and (location ?x) (at chair ?x) (at monkey ?x))
	     :effect (and (onchair ?x) (not (on-floor))))
  
  (:action MOVE-CHAIR
	     :parameters (?x ?y)
	     :precondition (and (location ?x) (location ?y) (at chair ?y) (at monkey ?y) 
				 (on-floor))
	     :effect (and (at monkey ?x) (not (at monkey ?y))
			   (at chair ?x)    (not (at chair ?y))))

  (:action GET-BANANAS
	     :parameters (?y)
	     :precondition (and (location ?y)
                (at bananas ?y) (onchair ?y))
	     :effect (hasbananas))
)

; problem
(define (problem monkey_1)
    (:domain monkey-bananas)
  	(:objects p1 p2 p3)
  	(:init 	(location p1) 
		(location p2)
		(location p3)
	 	(at monkey p1)
		(on-floor)
	 	(at chair p2)
	 	(at bananas p3)
	)
  	(:goal (and (hasbananas)))
)

; plan
1. (move-monkey p2 p1)
   deleted: (at monkey p1)
   added: (at monkey p2)
   goals met: 0 of 1
2. (move-chair p3 p2)
   deleted: (at monkey p2) (at chair p2)
   added: (at monkey p3) (at chair p3)
   goals met: 0 of 1
3. (climb p3)
   deleted: (on-floor)
   added: (onchair p3)
   goals met: 0 of 1
4. (get-bananas p3)
   added: (hasbananas)
   goals met: 1 of 1
